
Процедура ПроверитьВедомостьПриВыполнении(ТочкаМаршрута, Задача, Отказ)
	
	Проверена = Истина;

	Если НЕ ПустаяСтрока(СокрЛП(Строка(Задача.КомментарийИсполнителя))) Тогда
		Комментарий = Задача.КомментарийИсполнителя;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьВедомостьПриСозданииЗадач(ТочкаМаршрута, ФормируемыеЗадачи, Отказ)
	
	Для Каждого ФормируемаяЗадача Из ФормируемыеЗадачи Цикл

		ФормируемаяЗадача.Исполнитель = Ответственный;
		ФормируемаяЗадача.Наименование = "Проверить ведомость оценок";
		ФормируемаяЗадача.ОписаниеЗадачи = "Проверить ведомость оценок";

		Если ЗначениеЗаполнено(Ведомость) Тогда
			ФормируемаяЗадача.ОписаниеЗадачи = "Проверить ведомость оценок: " + Строка(Ведомость);
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры
