Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.РасписаниеЗанятий.Записывать = Истина;

	Для Каждого СтрокаЗанятия Из Занятия Цикл

		Если НЕ ЗначениеЗаполнено(УчебнаяГруппа) Тогда
			Продолжить;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(СтрокаЗанятия.Дисциплина) Тогда
			Продолжить;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(СтрокаЗанятия.Преподаватель) Тогда
			Продолжить;
		КонецЕсли;

		Движение = Движения.РасписаниеЗанятий.Добавить();
		Движение.Период = Дата;
		Движение.УчебнаяГруппа = УчебнаяГруппа;
		Движение.Дисциплина = СтрокаЗанятия.Дисциплина;
		Движение.Преподаватель = СтрокаЗанятия.Преподаватель;
		Движение.Аудитория = СтрокаЗанятия.Аудитория;
		Движение.УчебныйПериод = УчебныйПериод;
		Движение.ВидЗанятия = СтрокаЗанятия.ВидЗанятия;
		Движение.ДеньНедели = СтрокаЗанятия.ДеньНедели;
		Движение.НомерПары = СтрокаЗанятия.НомерПары;
		Движение.ВремяНачала = СтрокаЗанятия.ВремяНачала;
		Движение.ВремяОкончания = СтрокаЗанятия.ВремяОкончания;

	КонецЦикла;

КонецПроцедуры