
Процедура ПроверитьРасписаниеПриВыполнении(ТочкаМаршрута, Задача, Отказ)
	
	Согласовано = Истина;

	Если НЕ ПустаяСтрока(СокрЛП(Строка(Задача.КомментарийИсполнителя))) Тогда
		Комментарий = Задача.КомментарийИсполнителя;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьРасписаниеПриСозданииЗадач(ТочкаМаршрута, ФормируемыеЗадачи, Отказ)
	
	Для Каждого ФормируемаяЗадача Из ФормируемыеЗадачи Цикл

		ФормируемаяЗадача.Исполнитель = Ответственный;
		ФормируемаяЗадача.Наименование = "Проверить расписание";
		ФормируемаяЗадача.ОписаниеЗадачи = "Проверить расписание";

		Если ЗначениеЗаполнено(ДокументРасписания) Тогда
			ФормируемаяЗадача.ОписаниеЗадачи = "Проверить расписание: " + Строка(ДокументРасписания);
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры
