Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	ПериодДвижения = ?(ЗначениеЗаполнено(ДатаОценивания), ДатаОценивания, Дата);

	Движения.УспеваемостьСтудентов.Записывать = Истина;

	Для Каждого СтрокаОценки Из Оценки Цикл

		Если НЕ ЗначениеЗаполнено(СтрокаОценки.Студент) Тогда
			Продолжить;
		КонецЕсли;

		Если СтрокаОценки.Балл < 0 Тогда
			Продолжить;
		КонецЕсли;

		Движение = Движения.УспеваемостьСтудентов.Добавить();
		Движение.Период = ПериодДвижения;
		Движение.Студент = СтрокаОценки.Студент;
		Движение.УчебнаяГруппа = УчебнаяГруппа;
		Движение.Дисциплина = Дисциплина;
		Движение.ВидОценки = ВидОценки;
		Движение.Балл = СтрокаОценки.Балл;
		Движение.УчебныйПериод = УчебныйПериод;
		Движение.Преподаватель = Преподаватель;
		Движение.ОценкаТекстом = СтрокаОценки.ОценкаТекстом;

	КонецЦикла;

КонецПроцедуры