Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если НЕ Состоялось Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Преподаватель) Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Дисциплина) Тогда
		Возврат;
	КонецЕсли;

	Если КоличествоЧасов <= 0 Тогда
		Возврат;
	КонецЕсли;

Движения.УчебнаяНагрузкаПреподавателей.Записывать = Истина;

Движение = Движения.УчебнаяНагрузкаПреподавателей.Добавить();
Движение.Период = ДатаЗанятия;
Движение.Преподаватель = Преподаватель;
Движение.Дисциплина = Дисциплина;
Движение.УчебнаяГруппа = УчебнаяГруппа;
Движение.ВидЗанятия = ВидЗанятия;
Движение.КоличествоЧасов = КоличествоЧасов;
Движение.УчебныйПериод = УчебныйПериод;
Движение.Аудитория = Аудитория;

КонецПроцедуры