Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.СоставУчебныхГрупп.Записывать = Истина;

	Для Каждого СтрокаСтудента Из Студенты Цикл

		Если НЕ ЗначениеЗаполнено(СтрокаСтудента.Студент) Тогда
			Продолжить;
		КонецЕсли;

		Движение = Движения.СоставУчебныхГрупп.Добавить();
		Движение.Период = Дата;
		Движение.Студент = СтрокаСтудента.Студент;
		Движение.УчебнаяГруппа = СтрокаСтудента.УчебнаяГруппа;
		Движение.Статус = Перечисления.СтатусыСтудента.Отчислен;
		Движение.Основание = ПричинаОтчисления;

	КонецЦикла;

КонецПроцедуры