Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.ЗакреплениеДисциплинЗаПреподавателями.Записывать = Истина;

	Для Каждого СтрокаНазначения Из Назначения Цикл

		Если НЕ ЗначениеЗаполнено(СтрокаНазначения.УчебнаяГруппа) Тогда
			Продолжить;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(СтрокаНазначения.Дисциплина) Тогда
			Продолжить;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(СтрокаНазначения.Преподаватель) Тогда
			Продолжить;
		КонецЕсли;

		Движение = Движения.ЗакреплениеДисциплинЗаПреподавателями.Добавить();
		Движение.Период = Дата;
		Движение.УчебнаяГруппа = СтрокаНазначения.УчебнаяГруппа;
		Движение.Дисциплина = СтрокаНазначения.Дисциплина;
		Движение.ВидЗанятия = СтрокаНазначения.ВидЗанятия;
		Движение.Преподаватель = СтрокаНазначения.Преподаватель;
		Движение.КоличествоЧасов = СтрокаНазначения.КоличествоЧасов;
		Движение.УчебныйПериод = УчебныйПериод;

	КонецЦикла;

КонецПроцедуры