Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	ПериодДвижения = ?(ЗначениеЗаполнено(ДатаЗанятия), ДатаЗанятия, Дата);

	Движения.ПосещаемостьСтудентов.Записывать = Истина;

	Для Каждого СтрокаПосещаемости Из Посещаемость Цикл

		Если НЕ ЗначениеЗаполнено(СтрокаПосещаемости.Студент) Тогда
			Продолжить;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(СтрокаПосещаемости.ВидПосещения) Тогда
			Продолжить;
		КонецЕсли;

		Движение = Движения.ПосещаемостьСтудентов.Добавить();
		Движение.Период = ПериодДвижения;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Студент = СтрокаПосещаемости.Студент;
		Движение.УчебнаяГруппа = УчебнаяГруппа;
		Движение.Дисциплина = Дисциплина;
		Движение.ВидПосещения = СтрокаПосещаемости.ВидПосещения;
		Движение.Количество = 1;
		Движение.УчебныйПериод = УчебныйПериод;
		Движение.Преподаватель = Преподаватель;
		Движение.ПричинаОтсутствия = СтрокаПосещаемости.ПричинаОтсутствия;

	КонецЦикла;

КонецПроцедуры