Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.ПараметрыУчебногоПлана.Записывать = Истина;

	Для Каждого СтрокаДисциплины Из Дисциплины Цикл

		Если НЕ ЗначениеЗаполнено(УчебныйПлан) Тогда
			Продолжить;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(СтрокаДисциплины.Дисциплина) Тогда
			Продолжить;
		КонецЕсли;

		Движение = Движения.ПараметрыУчебногоПлана.Добавить();
		Движение.Период = Дата;
		Движение.УчебныйПлан = УчебныйПлан;
		Движение.Дисциплина = СтрокаДисциплины.Дисциплина;
		Движение.Семестр = СтрокаДисциплины.Семестр;
		Движение.КоличествоЧасов = СтрокаДисциплины.КоличествоЧасов;
		Движение.ЗачетныеЕдиницы = СтрокаДисциплины.ЗачетныеЕдиницы;
		Движение.ВидОценки = СтрокаДисциплины.ВидОценки;
		Движение.УчебныйПериод = УчебныйПериод;

	КонецЦикла;

КонецПроцедуры