
&НаСервере
Процедура ОчиститьТестовыеДанныеНаСервере()
	ЗагрузкаТестовыхДанныхСервер.ОчиститьВсеТестовыеДанные();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТестовыеДанные(Команда)
	
	ОчиститьТестовыеДанныеНаСервере();

	Сообщить("Очистка тестовых данных завершена.");
	
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьТестовымиДаннымиНаСервере()
	ЗагрузкаТестовыхДанныхСервер.ЗаполнитьВсеДанные();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТестовымиДанными(Команда)
	ЗаполнитьТестовымиДаннымиНаСервере();
	Сообщить("Загрузка тестовых данных завершена.");
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьТестовыеДанные(Команда)

	ПроверитьТестовыеДанныеНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПроверитьТестовыеДанныеНаСервере()

	ЗагрузкаТестовыхДанныхСервер.ПроверитьТестовыеДанные();

КонецПроцедуры